In [1]:
import findspark
findspark.init()

In [8]:
from pyspark.sql import SparkSession
from pyspark.sql.types import StructField, StringType, IntegerType, StructType

# setx PYSPARK_PYTHON <Python Path >

# go to the spark folder bin open terminal and type spark-shell

In [3]:
spark = SparkSession.builder.appName('demoApp').getOrCreate()

In [4]:
df = spark.read.json("members.json")

In [5]:
df.show()

+---+-------+
|age|   name|
+---+-------+
| 40|Sajeesh|
| 30|   Saby|
| 10| Pranal|
+---+-------+

In [6]:
df.printSchema()

root
 |-- age: long (nullable = true)
 |-- name: string (nullable = true)

In [7]:
df.describe().show()

+-------+------------------+-------+
|summary|               age|   name|
+-------+------------------+-------+
|  count|                 3|      3|
|   mean|26.666666666666668|   null|
| stddev|15.275252316519467|   null|
|    min|                10| Pranal|
|    max|                40|Sajeesh|
+-------+------------------+-------+

In [10]:
data_schema = [StructField("age", IntegerType()), StructField("name", StringType())]

In [11]:
type_f = StructType(fields=data_schema)

In [12]:
df2 = spark.read.json("members.json", schema=type_f)

In [13]:
df2.printSchema()

root
 |-- age: integer (nullable = true)
 |-- name: string (nullable = true)

In [14]:
df2['age']

Column<b'age'>

In [16]:
df2.select('age').show()

+---+
|age|
+---+
| 40|
| 30|
| 10|
+---+

In [17]:
df2.head(2)

[Row(age=40, name='Sajeesh'), Row(age=30, name='Saby')]

In [18]:
df2.head()

Row(age=40, name='Sajeesh')

In [19]:
df2.show()

+---+-------+
|age|   name|
+---+-------+
| 40|Sajeesh|
| 30|   Saby|
| 10| Pranal|
+---+-------+

In [20]:
df4 = spark.read.csv("titanic.csv", header=True, inferSchema=True)

In [21]:
df4.show()

+------+--------+--------------------+------+------+-----+-----+--------+--------+-------+--------+
|pclass|survived|                name|   sex|   age|sibsp|parch|  ticket|    fare|  cabin|embarked|
+------+--------+--------------------+------+------+-----+-----+--------+--------+-------+--------+
|     1|       1|Allen, Miss. Elis...|female|  29.0|    0|    0|   24160|211.3375|     B5|       S|
|     1|       1|Allison, Master. ...|  male|0.9167|    1|    2|  113781|  151.55|C22 C26|       S|
|     1|       0|Allison, Miss. He...|female|   2.0|    1|    2|  113781|  151.55|C22 C26|       S|
|     1|       0|Allison, Mr. Huds...|  male|  30.0|    1|    2|  113781|  151.55|C22 C26|       S|
|     1|       0|Allison, Mrs. Hud...|female|  25.0|    1|    2|  113781|  151.55|C22 C26|       S|
|     1|       1| Anderson, Mr. Harry|  male|  48.0|    0|    0|   19952|   26.55|    E12|       S|
|     1|       1|Andrews, Miss. Ko...|female|  63.0|    1|    0|   13502| 77.9583|     D7|       S|
|     1|       0|Andrews, Mr. Thom...|  male|  39.0|    0|    0|  112050|     0.0|    A36|       S|
|     1|       1|Appleton, Mrs. Ed...|female|  53.0|    2|    0|   11769| 51.4792|   C101|       S|
|     1|       0|Artagaveytia, Mr....|  male|  71.0|    0|    0|PC 17609| 49.5042|   null|       C|
|     1|       0|Astor, Col. John ...|  male|  47.0|    1|    0|PC 17757| 227.525|C62 C64|       C|
|     1|       1|Astor, Mrs. John ...|female|  18.0|    1|    0|PC 17757| 227.525|C62 C64|       C|
|     1|       1|Aubart, Mme. Leon...|female|  24.0|    0|    0|PC 17477|    69.3|    B35|       C|
|     1|       1|"Barber, Miss. El...|female|  26.0|    0|    0|   19877|   78.85|   null|       S|
|     1|       1|Barkworth, Mr. Al...|  male|  80.0|    0|    0|   27042|    30.0|    A23|       S|
|     1|       0| Baumann, Mr. John D|  male|  null|    0|    0|PC 17318|  25.925|   null|       S|
|     1|       0|Baxter, Mr. Quigg...|  male|  24.0|    0|    1|PC 17558|247.5208|B58 B60|       C|
|     1|       1|Baxter, Mrs. Jame...|female|  50.0|    0|    1|PC 17558|247.5208|B58 B60|       C|
|     1|       1|Bazzani, Miss. Al...|female|  32.0|    0|    0|   11813| 76.2917|    D15|       C|
|     1|       0|Beattie, Mr. Thomson|  male|  36.0|    0|    0|   13050| 75.2417|     C6|       C|
+------+--------+--------------------+------+------+-----+-----+--------+--------+-------+--------+
only showing top 20 rows

In [22]:
df4.printSchema()

root
 |-- pclass: integer (nullable = true)
 |-- survived: integer (nullable = true)
 |-- name: string (nullable = true)
 |-- sex: string (nullable = true)
 |-- age: double (nullable = true)
 |-- sibsp: integer (nullable = true)
 |-- parch: integer (nullable = true)
 |-- ticket: string (nullable = true)
 |-- fare: double (nullable = true)
 |-- cabin: string (nullable = true)
 |-- embarked: string (nullable = true)

In [23]:
df5 = spark.read.csv("titanic.csv", header=True, inferSchema=False)

In [24]:
df5.printSchema()

root
 |-- pclass: string (nullable = true)
 |-- survived: string (nullable = true)
 |-- name: string (nullable = true)
 |-- sex: string (nullable = true)
 |-- age: string (nullable = true)
 |-- sibsp: string (nullable = true)
 |-- parch: string (nullable = true)
 |-- ticket: string (nullable = true)
 |-- fare: string (nullable = true)
 |-- cabin: string (nullable = true)
 |-- embarked: string (nullable = true)

In [25]:
df4.columns

['pclass',
 'survived',
 'name',
 'sex',
 'age',
 'sibsp',
 'parch',
 'ticket',
 'fare',
 'cabin',
 'embarked']

In [26]:
df4.dtypes

[('pclass', 'int'),
 ('survived', 'int'),
 ('name', 'string'),
 ('sex', 'string'),
 ('age', 'double'),
 ('sibsp', 'int'),
 ('parch', 'int'),
 ('ticket', 'string'),
 ('fare', 'double'),
 ('cabin', 'string'),
 ('embarked', 'string')]

In [28]:
df4.head(10)

[Row(pclass=1, survived=1, name='Allen, Miss. Elisabeth Walton', sex='female', age=29.0, sibsp=0, parch=0, ticket='24160', fare=211.3375, cabin='B5', embarked='S'),
 Row(pclass=1, survived=1, name='Allison, Master. Hudson Trevor', sex='male', age=0.9167, sibsp=1, parch=2, ticket='113781', fare=151.55, cabin='C22 C26', embarked='S'),
 Row(pclass=1, survived=0, name='Allison, Miss. Helen Loraine', sex='female', age=2.0, sibsp=1, parch=2, ticket='113781', fare=151.55, cabin='C22 C26', embarked='S'),
 Row(pclass=1, survived=0, name='Allison, Mr. Hudson Joshua Creighton', sex='male', age=30.0, sibsp=1, parch=2, ticket='113781', fare=151.55, cabin='C22 C26', embarked='S'),
 Row(pclass=1, survived=0, name='Allison, Mrs. Hudson J C (Bessie Waldo Daniels)', sex='female', age=25.0, sibsp=1, parch=2, ticket='113781', fare=151.55, cabin='C22 C26', embarked='S'),
 Row(pclass=1, survived=1, name='Anderson, Mr. Harry', sex='male', age=48.0, sibsp=0, parch=0, ticket='19952', fare=26.55, cabin='E12', embarked='S'),
 Row(pclass=1, survived=1, name='Andrews, Miss. Kornelia Theodosia', sex='female', age=63.0, sibsp=1, parch=0, ticket='13502', fare=77.9583, cabin='D7', embarked='S'),
 Row(pclass=1, survived=0, name='Andrews, Mr. Thomas Jr', sex='male', age=39.0, sibsp=0, parch=0, ticket='112050', fare=0.0, cabin='A36', embarked='S'),
 Row(pclass=1, survived=1, name='Appleton, Mrs. Edward Dale (Charlotte Lamson)', sex='female', age=53.0, sibsp=2, parch=0, ticket='11769', fare=51.4792, cabin='C101', embarked='S'),
 Row(pclass=1, survived=0, name='Artagaveytia, Mr. Ramon', sex='male', age=71.0, sibsp=0, parch=0, ticket='PC 17609', fare=49.5042, cabin=None, embarked='C')]

In [29]:
df4.createOrReplaceTempView("titanic")

In [30]:
spark.sql("SELECT * from titanic").show()

+------+--------+--------------------+------+------+-----+-----+--------+--------+-------+--------+
|pclass|survived|                name|   sex|   age|sibsp|parch|  ticket|    fare|  cabin|embarked|
+------+--------+--------------------+------+------+-----+-----+--------+--------+-------+--------+
|     1|       1|Allen, Miss. Elis...|female|  29.0|    0|    0|   24160|211.3375|     B5|       S|
|     1|       1|Allison, Master. ...|  male|0.9167|    1|    2|  113781|  151.55|C22 C26|       S|
|     1|       0|Allison, Miss. He...|female|   2.0|    1|    2|  113781|  151.55|C22 C26|       S|
|     1|       0|Allison, Mr. Huds...|  male|  30.0|    1|    2|  113781|  151.55|C22 C26|       S|
|     1|       0|Allison, Mrs. Hud...|female|  25.0|    1|    2|  113781|  151.55|C22 C26|       S|
|     1|       1| Anderson, Mr. Harry|  male|  48.0|    0|    0|   19952|   26.55|    E12|       S|
|     1|       1|Andrews, Miss. Ko...|female|  63.0|    1|    0|   13502| 77.9583|     D7|       S|
|     1|       0|Andrews, Mr. Thom...|  male|  39.0|    0|    0|  112050|     0.0|    A36|       S|
|     1|       1|Appleton, Mrs. Ed...|female|  53.0|    2|    0|   11769| 51.4792|   C101|       S|
|     1|       0|Artagaveytia, Mr....|  male|  71.0|    0|    0|PC 17609| 49.5042|   null|       C|
|     1|       0|Astor, Col. John ...|  male|  47.0|    1|    0|PC 17757| 227.525|C62 C64|       C|
|     1|       1|Astor, Mrs. John ...|female|  18.0|    1|    0|PC 17757| 227.525|C62 C64|       C|
|     1|       1|Aubart, Mme. Leon...|female|  24.0|    0|    0|PC 17477|    69.3|    B35|       C|
|     1|       1|"Barber, Miss. El...|female|  26.0|    0|    0|   19877|   78.85|   null|       S|
|     1|       1|Barkworth, Mr. Al...|  male|  80.0|    0|    0|   27042|    30.0|    A23|       S|
|     1|       0| Baumann, Mr. John D|  male|  null|    0|    0|PC 17318|  25.925|   null|       S|
|     1|       0|Baxter, Mr. Quigg...|  male|  24.0|    0|    1|PC 17558|247.5208|B58 B60|       C|
|     1|       1|Baxter, Mrs. Jame...|female|  50.0|    0|    1|PC 17558|247.5208|B58 B60|       C|
|     1|       1|Bazzani, Miss. Al...|female|  32.0|    0|    0|   11813| 76.2917|    D15|       C|
|     1|       0|Beattie, Mr. Thomson|  male|  36.0|    0|    0|   13050| 75.2417|     C6|       C|
+------+--------+--------------------+------+------+-----+-----+--------+--------+-------+--------+
only showing top 20 rows

In [31]:
spark.sql("SELECT * from titanic where survived = 1").show()

+------+--------+--------------------+------+------+-----+-----+--------+--------+-------+--------+
|pclass|survived|                name|   sex|   age|sibsp|parch|  ticket|    fare|  cabin|embarked|
+------+--------+--------------------+------+------+-----+-----+--------+--------+-------+--------+
|     1|       1|Allen, Miss. Elis...|female|  29.0|    0|    0|   24160|211.3375|     B5|       S|
|     1|       1|Allison, Master. ...|  male|0.9167|    1|    2|  113781|  151.55|C22 C26|       S|
|     1|       1| Anderson, Mr. Harry|  male|  48.0|    0|    0|   19952|   26.55|    E12|       S|
|     1|       1|Andrews, Miss. Ko...|female|  63.0|    1|    0|   13502| 77.9583|     D7|       S|
|     1|       1|Appleton, Mrs. Ed...|female|  53.0|    2|    0|   11769| 51.4792|   C101|       S|
|     1|       1|Astor, Mrs. John ...|female|  18.0|    1|    0|PC 17757| 227.525|C62 C64|       C|
|     1|       1|Aubart, Mme. Leon...|female|  24.0|    0|    0|PC 17477|    69.3|    B35|       C|
|     1|       1|"Barber, Miss. El...|female|  26.0|    0|    0|   19877|   78.85|   null|       S|
|     1|       1|Barkworth, Mr. Al...|  male|  80.0|    0|    0|   27042|    30.0|    A23|       S|
|     1|       1|Baxter, Mrs. Jame...|female|  50.0|    0|    1|PC 17558|247.5208|B58 B60|       C|
|     1|       1|Bazzani, Miss. Al...|female|  32.0|    0|    0|   11813| 76.2917|    D15|       C|
|     1|       1|Beckwith, Mr. Ric...|  male|  37.0|    1|    1|   11751| 52.5542|    D35|       S|
|     1|       1|Beckwith, Mrs. Ri...|female|  47.0|    1|    1|   11751| 52.5542|    D35|       S|
|     1|       1|Behr, Mr. Karl Ho...|  male|  26.0|    0|    0|  111369|    30.0|   C148|       C|
|     1|       1|Bidois, Miss. Ros...|female|  42.0|    0|    0|PC 17757| 227.525|   null|       C|
|     1|       1|   Bird, Miss. Ellen|female|  29.0|    0|    0|PC 17483|221.7792|    C97|       S|
|     1|       1|Bishop, Mr. Dicki...|  male|  25.0|    1|    0|   11967| 91.0792|    B49|       C|
|     1|       1|Bishop, Mrs. Dick...|female|  19.0|    1|    0|   11967| 91.0792|    B49|       C|
|     1|       1|Bissette, Miss. A...|female|  35.0|    0|    0|PC 17760|135.6333|    C99|       S|
|     1|       1|Bjornstrom-Steffa...|  male|  28.0|    0|    0|  110564|   26.55|    C52|       S|
+------+--------+--------------------+------+------+-----+-----+--------+--------+-------+--------+
only showing top 20 rows

In [35]:
df4.withColumn('half_age', df4['age'] / 2).show()

+------+--------+--------------------+------+------+-----+-----+--------+--------+-------+--------+--------+
|pclass|survived|                name|   sex|   age|sibsp|parch|  ticket|    fare|  cabin|embarked|half_age|
+------+--------+--------------------+------+------+-----+-----+--------+--------+-------+--------+--------+
|     1|       1|Allen, Miss. Elis...|female|  29.0|    0|    0|   24160|211.3375|     B5|       S|    14.5|
|     1|       1|Allison, Master. ...|  male|0.9167|    1|    2|  113781|  151.55|C22 C26|       S| 0.45835|
|     1|       0|Allison, Miss. He...|female|   2.0|    1|    2|  113781|  151.55|C22 C26|       S|     1.0|
|     1|       0|Allison, Mr. Huds...|  male|  30.0|    1|    2|  113781|  151.55|C22 C26|       S|    15.0|
|     1|       0|Allison, Mrs. Hud...|female|  25.0|    1|    2|  113781|  151.55|C22 C26|       S|    12.5|
|     1|       1| Anderson, Mr. Harry|  male|  48.0|    0|    0|   19952|   26.55|    E12|       S|    24.0|
|     1|       1|Andrews, Miss. Ko...|female|  63.0|    1|    0|   13502| 77.9583|     D7|       S|    31.5|
|     1|       0|Andrews, Mr. Thom...|  male|  39.0|    0|    0|  112050|     0.0|    A36|       S|    19.5|
|     1|       1|Appleton, Mrs. Ed...|female|  53.0|    2|    0|   11769| 51.4792|   C101|       S|    26.5|
|     1|       0|Artagaveytia, Mr....|  male|  71.0|    0|    0|PC 17609| 49.5042|   null|       C|    35.5|
|     1|       0|Astor, Col. John ...|  male|  47.0|    1|    0|PC 17757| 227.525|C62 C64|       C|    23.5|
|     1|       1|Astor, Mrs. John ...|female|  18.0|    1|    0|PC 17757| 227.525|C62 C64|       C|     9.0|
|     1|       1|Aubart, Mme. Leon...|female|  24.0|    0|    0|PC 17477|    69.3|    B35|       C|    12.0|
|     1|       1|"Barber, Miss. El...|female|  26.0|    0|    0|   19877|   78.85|   null|       S|    13.0|
|     1|       1|Barkworth, Mr. Al...|  male|  80.0|    0|    0|   27042|    30.0|    A23|       S|    40.0|
|     1|       0| Baumann, Mr. John D|  male|  null|    0|    0|PC 17318|  25.925|   null|       S|    null|
|     1|       0|Baxter, Mr. Quigg...|  male|  24.0|    0|    1|PC 17558|247.5208|B58 B60|       C|    12.0|
|     1|       1|Baxter, Mrs. Jame...|female|  50.0|    0|    1|PC 17558|247.5208|B58 B60|       C|    25.0|
|     1|       1|Bazzani, Miss. Al...|female|  32.0|    0|    0|   11813| 76.2917|    D15|       C|    16.0|
|     1|       0|Beattie, Mr. Thomson|  male|  36.0|    0|    0|   13050| 75.2417|     C6|       C|    18.0|
+------+--------+--------------------+------+------+-----+-----+--------+--------+-------+--------+--------+
only showing top 20 rows

In [37]:
df4.withColumnRenamed('name', 'new_name').show()

+------+--------+--------------------+------+------+-----+-----+--------+--------+-------+--------+
|pclass|survived|            new_name|   sex|   age|sibsp|parch|  ticket|    fare|  cabin|embarked|
+------+--------+--------------------+------+------+-----+-----+--------+--------+-------+--------+
|     1|       1|Allen, Miss. Elis...|female|  29.0|    0|    0|   24160|211.3375|     B5|       S|
|     1|       1|Allison, Master. ...|  male|0.9167|    1|    2|  113781|  151.55|C22 C26|       S|
|     1|       0|Allison, Miss. He...|female|   2.0|    1|    2|  113781|  151.55|C22 C26|       S|
|     1|       0|Allison, Mr. Huds...|  male|  30.0|    1|    2|  113781|  151.55|C22 C26|       S|
|     1|       0|Allison, Mrs. Hud...|female|  25.0|    1|    2|  113781|  151.55|C22 C26|       S|
|     1|       1| Anderson, Mr. Harry|  male|  48.0|    0|    0|   19952|   26.55|    E12|       S|
|     1|       1|Andrews, Miss. Ko...|female|  63.0|    1|    0|   13502| 77.9583|     D7|       S|
|     1|       0|Andrews, Mr. Thom...|  male|  39.0|    0|    0|  112050|     0.0|    A36|       S|
|     1|       1|Appleton, Mrs. Ed...|female|  53.0|    2|    0|   11769| 51.4792|   C101|       S|
|     1|       0|Artagaveytia, Mr....|  male|  71.0|    0|    0|PC 17609| 49.5042|   null|       C|
|     1|       0|Astor, Col. John ...|  male|  47.0|    1|    0|PC 17757| 227.525|C62 C64|       C|
|     1|       1|Astor, Mrs. John ...|female|  18.0|    1|    0|PC 17757| 227.525|C62 C64|       C|
|     1|       1|Aubart, Mme. Leon...|female|  24.0|    0|    0|PC 17477|    69.3|    B35|       C|
|     1|       1|"Barber, Miss. El...|female|  26.0|    0|    0|   19877|   78.85|   null|       S|
|     1|       1|Barkworth, Mr. Al...|  male|  80.0|    0|    0|   27042|    30.0|    A23|       S|
|     1|       0| Baumann, Mr. John D|  male|  null|    0|    0|PC 17318|  25.925|   null|       S|
|     1|       0|Baxter, Mr. Quigg...|  male|  24.0|    0|    1|PC 17558|247.5208|B58 B60|       C|
|     1|       1|Baxter, Mrs. Jame...|female|  50.0|    0|    1|PC 17558|247.5208|B58 B60|       C|
|     1|       1|Bazzani, Miss. Al...|female|  32.0|    0|    0|   11813| 76.2917|    D15|       C|
|     1|       0|Beattie, Mr. Thomson|  male|  36.0|    0|    0|   13050| 75.2417|     C6|       C|
+------+--------+--------------------+------+------+-----+-----+--------+--------+-------+--------+
only showing top 20 rows

In [38]:
df4.groupBy("sex").sum().show()

+------+-----------+-------------+------------------+----------+----------+------------------+
|   sex|sum(pclass)|sum(survived)|          sum(age)|sum(sibsp)|sum(parch)|         sum(fare)|
+------+-----------+-------------+------------------+----------+----------+------------------+
|female|       1004|          339|        11130.5834|       304|       295|21528.313000000027|
|  male|       2000|          161|20125.083300000002|       349|       209|22022.173899999896|
+------+-----------+-------------+------------------+----------+----------+------------------+

In [40]:
df4.groupBy("sex", "pclass").count().show()

+------+------+-----+
|   sex|pclass|count|
+------+------+-----+
|female|     1|  144|
|  male|     1|  179|
|  male|     2|  171|
|female|     2|  106|
|  male|     3|  493|
|female|     3|  216|
+------+------+-----+